#+STARTUP: content
** PHP
   Install php-mode
   #+BEGIN_SRC emacs-lisp
     (use-package php-mode
       :ensure t
       :config
       ;; delete trailing whitespace on save
       (add-to-list 'write-file-functions 'delete-trailing-whitespace)

       ;; make these variables local
       (make-local-variable 'web-mode-code-indent-offset)
       (make-local-variable 'web-mode-markup-indent-offset)
       (make-local-variable 'web-mode-css-indent-offset)

       ;; set indentation, can set different indentation level for different code type
       (setq web-mode-code-indent-offset 4)
       (setq web-mode-css-indent-offset 2)
       (setq web-mode-markup-indent-offset 2))
   #+END_SRC

   Install autocomplete to php-mode
   #+BEGIN_SRC emacs-lisp
     (use-package ac-php
       :ensure t)
   #+END_SRC

   Minor modes
   #+BEGIN_SRC emacs-lisp
     (defun rzani/php-mode-hook()
       "Configures php-mode"

       ;; Autocomplete
       (auto-complete-mode t)
       (setq ac-sources (append '(ac-source-php) ac-sources))

       ;; Pair brackets
       (electric-pair-mode 1))

     (add-hook 'php-mode-hook 'rzani/php-mode-hook)
   #+END_SRC

   #+RESULTS:
   | rzani/php-mode-hook |

